Merge pull request #5 from alehardmode/update-docs
Fix
